# Сформувати функцію для обчислення цифрового кореню натурального числа.
# Цифровий корінь отримується наступним чином: необхідно скласти всі цифри заданого
# числа, потім скласти всі цифри знайденої суми і повторювати процес до тих пір, поки
# сума не буде дорівнювати однозначному числу, що і буде цифровим коренем заданого
# числа.
# Дудук Вадим
x = int(input('Введите а'))


def kor_rec(x):
    if len(str(x)) == 1:
        return (x)
    else:
        return kor_rec(sum([int(i) for i in str(x)]))


print(kor_rec(x))


def kor_iter(x):
    s = str(x)
    while len(s) > 1:
        x = 0
        for i in s:
            x += int(i)
        s = str(x)
    print(s)


kor_iter(x)
# В даній задачі, рекурсивний метод рішення виглядає краще , а також він є полегшеним варіантом ітераціїї
